tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Utility for directing compilation
brew "make"
# Manage multiple Node.js versions
brew "nvm"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Application launcher and productivity software
cask "alfred"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Software for Logitech devices
cask "logitech-options"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Window manager
cask "tiles"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
