tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"


# Official Amazon AWS command-line interface
brew "awscli"

# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"

# Fast and simple Node.js version manager
brew "fnm"

# Distributed revision control system
brew "git"


# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"


# Theme for zsh
brew "powerlevel10k"

# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Design tool
cask "canva"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Launcher for *Epic Games* games
cask "epic-games"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Window manager
cask "tiles"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "CleanMyMac X", id: 1339170533
mas "DaVinci Resolve", id: 571213070
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "Hidden Bar", id: 1452453066
mas "Microsoft Remote Desktop", id: 1295203466
mas "Okta Verify", id: 490179405
mas "Overlap", id: 1516950324
mas "Red Lines Tools", id: 1469400117
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
vscode "alefragnani.bookmarks"
vscode "britesnow.vscode-toggle-quotes"
vscode "chakrounanas.turbo-console-log"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "doggy8088.quicktype-refresh"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "google.arb-editor"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "herrmannplatz.npm-dependency-links"
vscode "hzgood.dart-data-class-generator"
vscode "jeroen-meijer.pubspec-assist"
vscode "johnpapa.vscode-peacock"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "pnp.polacode"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "simonsiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
